sterentev/atdf-device-asm-include/inc/ATmega32U4.inc
; ----------	Register TIMSK3 bits		------------------------
.equ	ICIE3		= 5		; 0x20 - Timer/Counter3 Input Capture Interrupt Enable
.equ	OCIE3C		= 3		; 0x08 - Timer/Counter3 Output Compare C Match Interrupt Enable
.equ	OCIE3B		= 2		; 0x04 - Timer/Counter3 Output Compare B Match Interrupt Enable
.equ	OCIE3A		= 1		; 0x02 - Timer/Counter3 Output Compare A Match Interrupt Enable
.equ	TOIE3		= 0		; 0x01 - Timer/Counter3 Overflow Interrupt Enable

; ----------	Register TIFR3 bits		------------------------
.equ	ICF3		= 5		; 0x20 - Input Capture Flag 3
.equ	OCF3C		= 3		; 0x08 - Output Compare Flag 3C
.equ	OCF3B		= 2		; 0x04 - Output Compare Flag 3B
.equ	OCF3A		= 1		; 0x02 - Output Compare Flag 3A
.equ	TOV3		= 0		; 0x01 - Timer/Counter3 Overflow Flag

; ----------	Register TCCR1A bits		------------------------
.equ	COM1A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM1A0		= 6		;          COM1A BIT0 position
.equ	COM1B_MASK	= 0x30		;      - Compare Output Mode 1B, bits (2 bits)
.equ	COM1B0		= 4		;          COM1B BIT0 position
.equ	COM1C_MASK	= 0x0C		;      - Compare Output Mode 1C, bits (2 bits)
.equ	COM1C0		= 2		;          COM1C BIT0 position
.equ	TCCR1A_WGM1_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR1A_WGM10	= 0		;          TCCR1A_WGM1 BIT0 position

; ----------	Register TCCR1B bits		------------------------
.equ	ICNC1		= 7		; 0x80 - Input Capture 1 Noise Canceler
.equ	ICES1		= 6		; 0x40 - Input Capture 1 Edge Select
.equ	TCCR1B_WGM1_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR1B_WGM10	= 3		;          TCCR1B_WGM1 BIT0 position
.equ	CS1_MASK	= 0x07		;      - Prescaler source of Timer/Counter 1 (3 bits)
.equ	CS10		= 0		;          CS1 BIT0 position
; ::::  CS1	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare 1A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare 1B
.equ	FOC1C		= 5		; 0x20 - Force Output Compare 1C

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 5		; 0x20 - Input Capture Flag 1
.equ	OCF1C		= 3		; 0x08 - Output Compare Flag 1C
.equ	OCF1B		= 2		; 0x04 - Output Compare Flag 1B
.equ	OCF1A		= 1		; 0x02 - Output Compare Flag 1A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag



; ====	TC10 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR4A bits		------------------------
.equ	COM4A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM4A0		= 6		;          COM4A BIT0 position
.equ	COM4B_MASK	= 0x30		;      - Compare Output Mode 4B, bits (2 bits)
.equ	COM4B0		= 4		;          COM4B BIT0 position
.equ	FOC4A		= 3		; 0x08 - Force Output Compare Match 4A
.equ	FOC4B		= 2		; 0x04 - Force Output Compare Match 4B
.equ	PWM4A		= 1		; 0x02 - 
.equ	PWM4B		= 0		; 0x01 - 

; ----------	Register TCCR4B bits		------------------------
.equ	PWM4X		= 7		; 0x80 - PWM Inversion Mode
.equ	PSR4		= 6		; 0x40 - Prescaler Reset Timer/Counter 4
.equ	DTPS4_MASK	= 0x30		;      - Dead Time Prescaler Bits (2 bits)
.equ	DTPS40		= 4		;          DTPS4 BIT0 position
.equ	CS4_MASK	= 0x0F		;      - Clock Select Bits (4 bits)
.equ	CS40		= 0		;          CS4 BIT0 position

; ----------	Register TCCR4C bits		------------------------
.equ	COM4A1S		= 7		; 0x80 - Comparator A Output Mode
.equ	COM4A0S		= 6		; 0x40 - Comparator A Output Mode
.equ	COM4B1S		= 5		; 0x20 - Comparator B Output Mode
.equ	COM4B0S		= 4		; 0x10 - Comparator B Output Mode
.equ	COM4D_MASK	= 0x0C		;      - Comparator D Output Mode (2 bits)
.equ	COM4D0		= 2		;          COM4D BIT0 position
.equ	FOC4D		= 1		; 0x02 - Force Output Compare Match 4D
.equ	PWM4D		= 0		; 0x01 - Pulse Width Modulator D Enable

; ----------	Register TCCR4D bits		------------------------
.equ	FPIE4		= 7		; 0x80 - Fault Protection Interrupt Enable
.equ	FPEN4		= 6		; 0x40 - Fault Protection Mode Enable
.equ	FPNC4		= 5		; 0x20 - Fault Protection Noise Canceler
.equ	FPES4		= 4		; 0x10 - Fault Protection Edge Select
.equ	FPAC4		= 3		; 0x08 - Fault Protection Analog Comparator Enable
.equ	FPF4		= 2		; 0x04 - Fault Protection Interrupt Flag
.equ	WGM4_MASK	= 0x03		;      - Waveform Generation Mode bits (2 bits)
.equ	WGM40		= 0		;          WGM4 BIT0 position

; ----------	Register TCCR4E bits		------------------------
.equ	TLOCK4		= 7		; 0x80 - Register Update Lock
.equ	ENHC4		= 6		; 0x40 - Enhanced Compare/PWM Mode
.equ	OC4OE_MASK	= 0x3F		;      - Output Compare Override Enable bit (6 bits)
.equ	OC4OE0		= 0		;          OC4OE BIT0 position

; ----------	Register TIMSK4 bits		------------------------
.equ	OCIE4D		= 7		; 0x80 - Timer/Counter4 Output Compare D Match Interrupt Enable
.equ	OCIE4A		= 6		; 0x40 - Timer/Counter4 Output Compare A Match Interrupt Enable
.equ	OCIE4B		= 5		; 0x20 - Timer/Counter4 Output Compare B Match Interrupt Enable
.equ	TOIE4		= 2		; 0x04 - Timer/Counter4 Overflow Interrupt Enable

; ----------	Register TIFR4 bits		------------------------
.equ	OCF4D		= 7		; 0x80 - Output Compare Flag 4D
.equ	OCF4A		= 6		; 0x40 - Output Compare Flag 4A
.equ	OCF4B		= 5		; 0x20 - Output Compare Flag 4B
.equ	TOV4		= 2		; 0x04 - Timer/Counter4 Overflow Flag

; ----------	Register DT4 bits		------------------------
.equ	DT4L_MASK	= 0xFF		;      - Timer/Counter 4 Dead Time Value Bits (8 bits)
.equ	DT4L0		= 0		;          DT4L BIT0 position



