sterentev/atdf-device-asm-include/inc/ATmega32U4.inc
; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
;.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register RCCTRL bits		------------------------
.equ	RCFREQ		= 0		; 0x01 - 

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register RAMPZ bits		------------------------
.equ	Res_MASK	= 0xFC		;      - Reserved (6 bits)
.equ	Res0		= 2		;          Res BIT0 position
.equ	RAMPZ_MASK	= 0x03		;      - Extended Z-Pointer Value (2 bits)
.equ	RAMPZ0		= 0		;          RAMPZ BIT0 position
; ::::  RAMPZ	:::: bitfield values
;			0x00		; Default value of Z-pointer MSB's.

; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 2 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 1 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose IO Register 0 bit 7
.equ	GPIOR06		= 6		; 0x40 - General Purpose IO Register 0 bit 6
.equ	GPIOR05		= 5		; 0x20 - General Purpose IO Register 0 bit 5
.equ	GPIOR04		= 4		; 0x10 - General Purpose IO Register 0 bit 4
.equ	GPIOR03		= 3		; 0x08 - General Purpose IO Register 0 bit 3
.equ	GPIOR02		= 2		; 0x04 - General Purpose IO Register 0 bit 2
.equ	GPIOR01		= 1		; 0x02 - General Purpose IO Register 0 bit 1
.equ	GPIOR00		= 0		; 0x01 - General Purpose IO Register 0 bit 0

; ----------	Register PRR1 bits		------------------------
.equ	PRUSB		= 7		; 0x80 - Power Reduction USB
.equ	PRTIM4		= 4		; 0x10 - Power Reduction Timer/Counter4
.equ	PRTIM3		= 3		; 0x08 - Power Reduction Timer/Counter3
.equ	PRUSART1	= 0		; 0x01 - Power Reduction USART1

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI		= 7		; 0x80 - Power Reduction TWI
.equ	PRTIM2		= 6		; 0x40 - Power Reduction Timer/Counter2
.equ	PRTIM0		= 5		; 0x20 - Power Reduction Timer/Counter0
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register CLKSTA bits		------------------------
.equ	RCON		= 1		; 0x02 - 
.equ	EXTON		= 0		; 0x01 - 

; ----------	Register CLKSEL1 bits		------------------------
.equ	RCCKSEL_MASK	= 0xF0		;      -  (4 bits)
.equ	RCCKSEL0	= 4		;          RCCKSEL BIT0 position
.equ	EXCKSEL_MASK	= 0x0F		;      -  (4 bits)
.equ	EXCKSEL0	= 0		;          EXCKSEL BIT0 position

; ----------	Register CLKSEL0 bits		------------------------
.equ	RCSUT_MASK	= 0xC0		;      -  (2 bits)
.equ	RCSUT0		= 6		;          RCSUT BIT0 position
.equ	EXSUT_MASK	= 0x30		;      -  (2 bits)
.equ	EXSUT0		= 4		;          EXSUT BIT0 position
.equ	RCE		= 3		; 0x08 - 
.equ	EXTE		= 2		; 0x04 - 
.equ	CLKS		= 0		; 0x01 - 



; ====	PLL MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PLLCSR bits		------------------------
.equ	PINDIV		= 4		; 0x10 - PLL prescaler Bit 2
.equ	PLLE		= 1		; 0x02 - PLL Enable Bit
.equ	PLOCK		= 0		; 0x01 - PLL Lock Status Bit

; ----------	Register PLLFRQ bits		------------------------
.equ	PINMUX		= 7		; 0x80 - 
.equ	PLLUSB		= 6		; 0x40 - 
.equ	PLLTM_MASK	= 0x30		;      -  (2 bits)
.equ	PLLTM0		= 4		;          PLLTM BIT0 position
.equ	PDIV_MASK	= 0x0F		;      -  (4 bits)
.equ	PDIV0		= 0		;          PDIV BIT0 position



; ====	USB_DEVICE MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register UEDATX bits		------------------------
.equ	DAT_MASK	= 0xFF		;      -  (8 bits)
.equ	DAT0		= 0		;          DAT BIT0 position

; ----------	Register UEIENX bits		------------------------
.equ	FLERRE		= 7		; 0x80 - 
.equ	NAKINE		= 6		; 0x40 - 
.equ	NAKOUTE		= 4		; 0x10 - 
.equ	RXSTPE		= 3		; 0x08 - 
.equ	RXOUTE		= 2		; 0x04 - 
.equ	STALLEDE	= 1		; 0x02 - 
.equ	TXINE		= 0		; 0x01 - 

; ----------	Register UESTA1X bits		------------------------
.equ	CTRLDIR		= 2		; 0x04 - 
.equ	CURRBK_MASK	= 0x03		;      -  (2 bits)
.equ	CURRBK0		= 0		;          CURRBK BIT0 position

; ----------	Register UESTA0X bits		------------------------
.equ	CFGOK		= 7		; 0x80 - 
.equ	OVERFI		= 6		; 0x40 - 
.equ	UNDERFI		= 5		; 0x20 - 
.equ	DTSEQ_MASK	= 0x0C		;      -  (2 bits)
.equ	DTSEQ0		= 2		;          DTSEQ BIT0 position
.equ	NBUSYBK_MASK	= 0x03		;      -  (2 bits)
.equ	NBUSYBK0	= 0		;          NBUSYBK BIT0 position

