sterentev/atdf-device-asm-include/inc/ATmega32U4.inc
; ----------	Register UECFG1X bits		------------------------
.equ	EPSIZE_MASK	= 0x70		;      -  (3 bits)
.equ	EPSIZE0		= 4		;          EPSIZE BIT0 position
.equ	EPBK_MASK	= 0x0C		;      -  (2 bits)
.equ	EPBK0		= 2		;          EPBK BIT0 position
.equ	ALLOC		= 1		; 0x02 - 

; ----------	Register UECFG0X bits		------------------------
.equ	EPTYPE_MASK	= 0xC0		;      -  (2 bits)
.equ	EPTYPE0		= 6		;          EPTYPE BIT0 position
.equ	EPDIR		= 0		; 0x01 - 

; ----------	Register UECONX bits		------------------------
.equ	STALLRQ		= 5		; 0x20 - 
.equ	STALLRQC	= 4		; 0x10 - 
.equ	RSTDT		= 3		; 0x08 - 
.equ	EPEN		= 0		; 0x01 - 

; ----------	Register UERST bits		------------------------
.equ	EPRST_MASK	= 0x7F		;      -  (7 bits)
.equ	EPRST0		= 0		;          EPRST BIT0 position

; ----------	Register UEINTX bits		------------------------
.equ	FIFOCON		= 7		; 0x80 - 
.equ	NAKINI		= 6		; 0x40 - 
.equ	RWAL		= 5		; 0x20 - 
.equ	NAKOUTI		= 4		; 0x10 - 
.equ	RXSTPI		= 3		; 0x08 - 
.equ	RXOUTI		= 2		; 0x04 - 
.equ	STALLEDI	= 1		; 0x02 - 
.equ	TXINI		= 0		; 0x01 - 

; ----------	Register UDMFN bits		------------------------
.equ	FNCERR		= 4		; 0x10 - 

; ----------	Register UDADDR bits		------------------------
.equ	ADDEN		= 7		; 0x80 - 
.equ	UADD_MASK	= 0x7F		;      -  (7 bits)
.equ	UADD0		= 0		;          UADD BIT0 position

; ----------	Register UDIEN bits		------------------------
.equ	UPRSME		= 6		; 0x40 - 
.equ	EORSME		= 5		; 0x20 - 
.equ	WAKEUPE		= 4		; 0x10 - 
.equ	EORSTE		= 3		; 0x08 - 
.equ	SOFE		= 2		; 0x04 - 
.equ	SUSPE		= 0		; 0x01 - 

; ----------	Register UDINT bits		------------------------
.equ	UPRSMI		= 6		; 0x40 - 
.equ	EORSMI		= 5		; 0x20 - 
.equ	WAKEUPI		= 4		; 0x10 - 
.equ	EORSTI		= 3		; 0x08 - 
.equ	SOFI		= 2		; 0x04 - 
.equ	SUSPI		= 0		; 0x01 - 

; ----------	Register UDCON bits		------------------------
.equ	LSM		= 2		; 0x04 - USB low speed mode
.equ	RSTCPU		= 3		; 0x08 - 
.equ	RMWKUP		= 1		; 0x02 - 
.equ	DETACH		= 0		; 0x01 - 

; ----------	Register USBCON bits		------------------------
.equ	USBE		= 7		; 0x80 - 
.equ	FRZCLK		= 5		; 0x20 - 
.equ	OTGPADE		= 4		; 0x10 - 
.equ	VBUSTE		= 0		; 0x01 - 

; ----------	Register USBINT bits		------------------------
.equ	VBUSTI		= 0		; 0x01 - 

; ----------	Register USBSTA bits		------------------------
.equ	SPEED		= 3		; 0x08 - 
.equ	VBUS		= 0		; 0x01 - 

; ----------	Register UHWCON bits		------------------------
.equ	UVREGE		= 0		; 0x01 - 




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 43
.equ	INT_VECTORS_SIZE	= 0x56
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	INT3		; External Interrupt Request 3
;	5	Reserved1	; Reserved1
;	6	Reserved2	; Reserved2
;	7	INT6		; External Interrupt Request 6
;	8	Reserved3	; Reserved3
;	9	PCINT0		; Pin Change Interrupt Request 0
;	10	USB_GEN		; USB General Interrupt Request
;	11	USB_COM		; USB Endpoint/Pipe Interrupt Communication Request
;	12	WDT		; Watchdog Time-out Interrupt
;	13	Reserved4	; Reserved4
;	14	Reserved5	; Reserved5
;	15	Reserved6	; Reserved6
;	16	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	17	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	18	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	19	TIMER1_COMPC	; Timer/Counter1 Compare Match C
;	20	TIMER1_OVF	; Timer/Counter1 Overflow
;	21	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	22	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	23	TIMER0_OVF	; Timer/Counter0 Overflow
;	24	SPI_STC		; SPI Serial Transfer Complete
;	25	USART1_RX	; USART1, Rx Complete
;	26	USART1_UDRE	; USART1 Data register Empty
;	27	USART1_TX	; USART1, Tx Complete
;	28	ANALOG_COMP	; Analog Comparator
;	29	ADC		; ADC Conversion Complete
;	30	EE_READY	; EEPROM Ready
;	31	TIMER3_CAPT	; Timer/Counter3 Capture Event
;	32	TIMER3_COMPA	; Timer/Counter3 Compare Match A
;	33	TIMER3_COMPB	; Timer/Counter3 Compare Match B
;	34	TIMER3_COMPC	; Timer/Counter3 Compare Match C
;	35	TIMER3_OVF	; Timer/Counter3 Overflow
;	36	TWI		; 2-wire Serial Interface        
;	37	SPM_READY	; Store Program Memory Read
;	38	TIMER4_COMPA	; Timer/Counter4 Compare Match A
;	39	TIMER4_COMPB	; Timer/Counter4 Compare Match B
;	40	TIMER4_COMPD	; Timer/Counter4 Compare Match D
;	41	TIMER4_OVF	; Timer/Counter4 Overflow
;	42	TIMER4_FPF	; Timer/Counter4 Fault Protection Interrupt



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmega32U4.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	BODLEVEL	= 0x03	; Brown-out detection at VCC=2.6 V
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  &  (~BODLEVEL_MASK | BODLEVEL) \
;#				  & ~(0 <<HWBE)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=1024 words start address=$3C00
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<OCDEN) \
;#				  & ~(1 <<JTAGEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x12	; Int. RC Osc.; Start-up time: 6 CK + 4.1 ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "===================="
;#	.message "-----  Fuses  ------"
;#	.message "EXTENDED        ", FUSES_EXTENDED
;#	.message "HIGH            ", FUSES_HIGH
;#	.message "LOW             ", FUSES_LOW
;#	.message "----- Lockbits -----"
;#	.message "LOCKBIT         ", LOCKBITS_LOCKBIT
;#	.message "===================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; Reserved1	 - Reserved1
;#		reti			; Reserved2	 - Reserved2
;#		reti			; INT6		 - External Interrupt Request 6
;#		reti			; Reserved3	 - Reserved3
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; USB_GEN	 - USB General Interrupt Request
;#		reti			; USB_COM	 - USB Endpoint/Pipe Interrupt Communication Request
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; Reserved4	 - Reserved4
;#		reti			; Reserved5	 - Reserved5
;#		reti			; Reserved6	 - Reserved6
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_COMPC	 - Timer/Counter1 Compare Match C
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART1_RX	 - USART1, Rx Complete
;#		reti			; USART1_UDRE	 - USART1 Data register Empty
;#		reti			; USART1_TX	 - USART1, Tx Complete
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; TIMER3_CAPT	 - Timer/Counter3 Capture Event
;#		reti			; TIMER3_COMPA	 - Timer/Counter3 Compare Match A
;#		reti			; TIMER3_COMPB	 - Timer/Counter3 Compare Match B
;#		reti			; TIMER3_COMPC	 - Timer/Counter3 Compare Match C
;#		reti			; TIMER3_OVF	 - Timer/Counter3 Overflow
;#		reti			; TWI		 - 2-wire Serial Interface        
;#		reti			; SPM_READY	 - Store Program Memory Read
;#		reti			; TIMER4_COMPA	 - Timer/Counter4 Compare Match A
;#		reti			; TIMER4_COMPB	 - Timer/Counter4 Compare Match B
;#		reti			; TIMER4_COMPD	 - Timer/Counter4 Compare Match D
;#		reti			; TIMER4_OVF	 - Timer/Counter4 Overflow
;#		reti			; TIMER4_FPF	 - Timer/Counter4 Fault Protection Interrupt
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA32U4_INC_ */

; ************************ END OF FILE *********************************

